<abi-corpus version='2.1'>
  <elf-variable-symbols>
    <elf-symbol name='cl' size='304' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='const_long.c' language='LANG_C11'>
    <type-decl name='long' size-in-bits='64' id='c2ecdf53'/>
    <class-decl name='CL' size-in-bits='2432' is-struct='yes' visibility='default' id='9c7510f2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='cl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='lc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='cli' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='lci' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='lic' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='cil' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='icl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='ilc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='csl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='scl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='slc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='cls' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='lcs' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='lsc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='cisl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='icsl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='iscl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='islc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='csil' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <var-decl name='scil' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='sicl' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1344'>
        <var-decl name='silc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1408'>
        <var-decl name='csli' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1472'>
        <var-decl name='scli' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1536'>
        <var-decl name='slci' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1600'>
        <var-decl name='slic' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1664'>
        <var-decl name='cils' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1728'>
        <var-decl name='icls' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1792'>
        <var-decl name='ilcs' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1856'>
        <var-decl name='ilsc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1920'>
        <var-decl name='clis' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1984'>
        <var-decl name='lcis' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2048'>
        <var-decl name='lics' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2112'>
        <var-decl name='lisc' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2176'>
        <var-decl name='clsi' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2240'>
        <var-decl name='lcsi' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2304'>
        <var-decl name='lsci' type-id='ca9c583a' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='2368'>
        <var-decl name='lsic' type-id='ca9c583a' visibility='default'/>
      </data-member>
    </class-decl>
    <qualified-type-def type-id='c2ecdf53' const='yes' id='ca9c583a'/>
    <var-decl name='cl' type-id='9c7510f2' mangled-name='cl' visibility='default' elf-symbol-id='cl'/>
  </abi-instr>
</abi-corpus>
