<abi-corpus version='2.1'>
  <elf-function-symbols>
    <elf-symbol name='fun' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <elf-symbol name='var' size='176' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr address-size='64' path='all_c99_types.c' language='LANG_C11'>
    <type-decl name='_Bool' size-in-bits='8' id='ae76e4a2'/>
    <type-decl name='char' size-in-bits='8' id='a84c031d'/>
    <type-decl name='double' size-in-bits='64' id='a0eb0f08'/>
    <type-decl name='float' size-in-bits='32' id='a6c45d85'/>
    <type-decl name='int' size-in-bits='32' id='95e97e5e'/>
    <type-decl name='long' size-in-bits='64' id='c2ecdf53'/>
    <type-decl name='long double' size-in-bits='128' id='e095c704'/>
    <type-decl name='long long' size-in-bits='64' id='63bc72a7'/>
    <type-decl name='short' size-in-bits='16' id='ba226bd5'/>
    <type-decl name='signed char' size-in-bits='8' id='28577a57'/>
    <type-decl name='unsigned char' size-in-bits='8' id='002ac4a6'/>
    <type-decl name='unsigned int' size-in-bits='32' id='f0981eeb'/>
    <type-decl name='unsigned long' size-in-bits='64' id='3aa0f67c'/>
    <type-decl name='unsigned long long' size-in-bits='64' id='4ccbc7e2'/>
    <type-decl name='unsigned short' size-in-bits='16' id='e280bb54'/>
    <class-decl name='Z' size-in-bits='1408' is-struct='yes' visibility='default' id='49d998f5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <var-decl name='a_bool' type-id='ae76e4a2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='8'>
        <var-decl name='a_char' type-id='a84c031d' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='16'>
        <var-decl name='a_signed_char' type-id='28577a57' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='24'>
        <var-decl name='an_unsigned_char' type-id='002ac4a6' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <var-decl name='a_short' type-id='ba226bd5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='48'>
        <var-decl name='a_short_int' type-id='ba226bd5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <var-decl name='a_signed_short' type-id='ba226bd5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='80'>
        <var-decl name='a_signed_short_int' type-id='ba226bd5' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <var-decl name='an_unsigned_short' type-id='e280bb54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='112'>
        <var-decl name='an_unsigned_short_int' type-id='e280bb54' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <var-decl name='an_int' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <var-decl name='a_signed' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <var-decl name='a_signed_int' type-id='95e97e5e' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='224'>
        <var-decl name='an_unsigned' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <var-decl name='an_unsigned_int' type-id='f0981eeb' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <var-decl name='a_long' type-id='c2ecdf53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <var-decl name='a_long_int' type-id='c2ecdf53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <var-decl name='a_signed_long' type-id='c2ecdf53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <var-decl name='a_signed_long_int' type-id='c2ecdf53' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <var-decl name='an_unsigned_long' type-id='3aa0f67c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <var-decl name='an_unsigned_long_int' type-id='3aa0f67c' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <var-decl name='a_long_long' type-id='63bc72a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <var-decl name='a_long_long_int' type-id='63bc72a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <var-decl name='a_signed_long_long' type-id='63bc72a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='896'>
        <var-decl name='a_signed_long_long_int' type-id='63bc72a7' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='960'>
        <var-decl name='an_unsigned_long_long' type-id='4ccbc7e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <var-decl name='an_unsigned_long_long_int' type-id='4ccbc7e2' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1088'>
        <var-decl name='a_float' type-id='a6c45d85' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <var-decl name='a_double' type-id='a0eb0f08' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1280'>
        <var-decl name='a_long_double' type-id='e095c704' visibility='default'/>
      </data-member>
    </class-decl>
    <var-decl name='var' type-id='49d998f5' mangled-name='var' visibility='default' elf-symbol-id='var'/>
    <function-decl name='fun' mangled-name='fun' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='fun'>
      <parameter type-id='49d998f5' name='z'/>
      <return type-id='48b5725f'/>
    </function-decl>
    <type-decl name='void' id='48b5725f'/>
  </abi-instr>
</abi-corpus>
